/******************************************************************************
	タイトル名 : EnemyManagerクラス
	ファイル名 : EnemyManager.h
	作成者     : AT-13C-284 36 深澤佑太
	作成日     : 2017/1/26
	更新日     :
******************************************************************************/
/******************************************************************************
	インクルードガード
******************************************************************************/
#pragma once

/******************************************************************************
	クラス宣言
******************************************************************************/
class CEnemyManager
{
public:
	CEnemyManager();		//	コンストラクタ。
	~CEnemyManager();		//	デストラクタ。

	void Update(void);		//	更新関数。
	static void Load(const char *fileName);		//	読み込み関数。

private:
	static int m_ActiveEnemyCnt;		//	生存している敵の数。
};

