/******************************************************************************
	タイトル名 : ゲームクラス
	ファイル名 : game.h
	作成者     : AT-13C-284 36 深澤佑太
	作成日     : 2016/07/14
	更新日     : 
******************************************************************************/
/******************************************************************************
	インクルードガード
******************************************************************************/
#pragma once

/******************************************************************************
	インクルードファイル
******************************************************************************/
/******************************************************************************
	ライブラリのリンク
******************************************************************************/
/******************************************************************************
	マクロ定義
******************************************************************************/
const float GRAVITY = 0.5f;		//	重力。

/******************************************************************************
	構造体宣言
******************************************************************************/
/******************************************************************************
	クラス
******************************************************************************/
//	前方宣言///////////////////////////////////////////////////////////////////
class CRenderer;
class CScene;
class CCamera;
class CLight;
class CMeshField;
class CBillboard;
class CInput;
class CPlayer;
class CPause;
class CBullet;
class CDust;
class CEnemy;
class CStencilShadow;
class CDustGenerater;

//	クラス本体/////////////////////////////////////////////////////////////////
class CGame : public CMode
{
public:
	CGame();		//	コンストラクタ
	~CGame();		//	デストラクタ

	void Init(void);		//	初期関数
	void Uninit(void);		//	終了関数
	void Update(void);		//	更新関数
	void Draw(void);		//	描画関数

	CCamera    *GetCamera(void) { return m_pCamera; }			//	カメラの取得関数。
	CMeshField *GetMeshField(void) { return m_MeshField; }		//	メッシュフィールド取得関数。
	CPlayer    *GetPlayer(void) { return m_Player; }			//	プレイヤーの取得。

	CStencilShadow *GetStencilShadow(void) { return m_StencilShadow; }
	static void UnusedPause(void) { m_PauseFlag = false; }		//	ポーズフラグをoffにする。
private:
	CCamera		  *m_pCamera;			//	カメラの情報。
	CLight		  *m_Light;				//	ライトの情報。
	CMeshField	  *m_MeshField;			//	メッシュフィールドの情報。
	CPlayer		  *m_Player;			//	プレイヤーの情報。
	CPause        *m_Pause;				//	ポーズの情報。
	CTexture      *m_pGameTexture;		//	テクスチャクラス。
	CStencilShadow *m_StencilShadow;	//	ステンシルシャドウ情報。
	CEnemy        *m_Enemy;				//	エネミークラス。
	CDustGenerater *m_DustGenerater;
	static bool    m_PauseFlag;			//	ポーズしてるかどうか。
};

