/******************************************************************************
	タイトル名 : SceneIndexクラス
	ファイル名 : sceneIndex.h
	作成者     : AT-13C-284 36 深澤佑太
	作成日     : 2016/12/12
	更新日     : 
				 
******************************************************************************/
/******************************************************************************
	インクルードガード
******************************************************************************/
#pragma once

/******************************************************************************
	クラス
******************************************************************************/
class CSceneIndex : public CScene3D
{
public:
	CSceneIndex(int Priority = NONE, OBJ_TYPE objType = OBJ_TYPE_NONE, SCENE_TYPE sceneType = SCENE_TYPE_NONE);		//	コンストラクタ。
	~CSceneIndex();		//	デストラクタ。

	void Uninit(void);		//	終了関数。
	void Draw(void);		//	描画関数。

protected:
	LPDIRECT3DINDEXBUFFER9  m_pIdxBuff;				//	インデクスバッファ。
	int m_VertexNum;		//	頂点数
	int m_PolygonNum;		//	ポリゴン数
};

