/******************************************************************************
	タイトル名 : タイマークラス
	ファイル名 : time.h
	作成者     : AT-13C-284 36 深澤佑太
	作成日     : 2017/01/12
	更新日     : 
******************************************************************************/
/******************************************************************************
	インクルードガード
******************************************************************************/
#pragma once

/******************************************************************************
	クラス
******************************************************************************/
//	前方宣言///////////////////////////////////////////////////////////////////
class CNumber;

//	クラス本体宣言/////////////////////////////////////////////////////////////
class CTime : public CScene2D
{
public:
	CTime(int Priority = OBJECT_2D, OBJ_TYPE objType = OBJ_TYPE_UI, SCENE_TYPE sceneType = SCENE_TYPE_GAME);		//	コンストラクタ。
	~CTime();		//	デストラクタ。

	void Init(void);	//	初期化関数。
	void Uninit(void);	//	終了関数。
	void Update(void);	//	更新関数。
	void Draw(void);	//	描画関数。
	static CTime *Create(void);		//	作成関数。
	static int GetTime(void) { return m_Time; }		//	時間取得。

private:
	static int m_Time;	//	タイムの初期値。
	int m_DigitNumber;	//	桁数。
	int m_TimerCnt;		//	タイムカウンタ。
	CNumber *m_Number;	//	ナンバー。
};