/******************************************************************************
	タイトル名 : CTitle_BGクラス
	ファイル名 : title_BG.h
	作成者     : AT-13C-284 35 深澤佑太
	作成日     : 2016/12/16
	更新日     : 
******************************************************************************/
/******************************************************************************
	インクルードファイル
******************************************************************************/
#pragma once

/******************************************************************************
	クラス宣言
******************************************************************************/
class CTitle_BG : public CScene2D
{
public:
	CTitle_BG(int Priority = OBJECT_2D, OBJ_TYPE objType = OBJ_TYPE_UI, SCENE_TYPE sceneType = SCENE_TYPE_TITLE);		//	コンストラクタ。
	~CTitle_BG();		//	デストラクタ。

	static CTitle_BG *Create(D3DXVECTOR3 pos, float width, float height, int textureType);		//	生成関数。
};

